--- a/pinpointsmscallbacks/README.md
+++ b/pinpointsmscallbacks/README.md
@@ -5,29 +5,28 @@ This lambda gets the Pinpoint receipt from AWS and then calls a task to update t
-![PlantUML model](./sms-callback.png)
 
-<!--
-@startuml
+```mermaid
+classDiagram
+Pinpoint-->CloudWatch
+CloudWatch-->Lambda
+Lambda-->Celery
 
-title GC Notify SMS Callbacks
-:**Pinpoint** Delivers an SMS;
-:SMS receipt is written to a **Cloudwatch** log;
-:Cloudwatch subscription filter triggers  the **pinpoint-to-sqs-sms-callbacks** lambda;
--> \n\n;
-partition #Technology "pinpoint-to-sqs-sms-callbacks" {
-  :Invokes Celery task **process-pinpoint-result**;
-}
--> \n;
-partition #Technology "process-pinpoint-result" {
-  :Calls user-specified API endpoint with result;
-  stop
-}
-@enduml
--->
+Pinpoint: delivers SMS
+Pinpoint: logs delivery status receipts
+
+CloudWatch: subscription filter triggers lambda with receipt
+
+class Lambda["pinpoint-to-sqs-sms-callbacks lambda function"]
+Lambda: schedules celery task with receipt
+
+class Celery["process-pinpoint-result celery task"]
+Celery: updates the notification status
+Celery: calls the user-specified callback endpoint with result
+```
